{
  "messages": [
    {
      "id": "2025-001",
      "date": "2025-01-15",
      "title": "Welcome to Integration Manager System Messages",
      "content": "<p>This new feature allows you to receive important announcements and updates about the Integration Manager.</p><p>Messages are marked as read automatically when you view this page.</p>",
      "priority": "normal"
    },
    {
      "id": "2024-003",
      "date": "2024-12-20",
      "title": "Orphaned Entities Diagnostics Available",
      "content": "<p>A new <strong>Diagnostics</strong> page has been added to help identify orphaned entities in your activities.</p><p>Orphaned entities can prevent activities from functioning properly. Visit the Diagnostics page to see if any activities need attention.</p>",
      "priority": "normal"
    },
    {
      "id": "2024-002",
      "date": "2024-12-01",
      "title": "Notification Settings Enhanced",
      "content": "<p>You can now receive notifications for:</p><ul><li>Integration updates</li><li>New integrations detected</li><li>Integration errors</li><li>Orphaned entities in activities</li></ul><p>Configure your preferences in the Notifications settings page.</p>",
      "priority": "low"
    },
    {
      "id": "2026-001",
      "date": "2026-01-30",
      "title": "Orphaned IR Codesets Cleanup Tool Released",
      "content": "<p>A new diagnostic tool has been released to help you identify and clean up orphaned IR codesets in your Remotes.</p><p>Visit the Diagnostics page to see if you have any orphaned IR codesets and learn more about this new feature and how it can help you maintain your integrations.</p>",
      "priority": "normal"
    },
    {
      "id": "2026-002",
      "date": "2026-02-01",
      "title": "Sort options in available integrations",
      "content": "<p>New sort options are now available in the integrations list.</p><p>You can sort integrations by name, github stars, downloads, newest, and last updated to help you find what you need more easily.</p><p>Due to github API limitations, it will take up to 8 hours for the initial cache of github data to complete. </p>",
      "priority": "normal"
    }
  ]
}
